Documents/НаправлениеСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НаправлениеСтационар</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диагноз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчреждениеНаправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбоснованиеНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВрачНаправивший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаведующийОтделением</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НаправлениеСтационар/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("НаправлениеСтационар","Направление в стационар");
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "НаправлениеСтационар" Тогда
		ТабДокумент = ПечатьНаправлениеСтационар(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьНаправлениеСтационар(СсылкаНаОбъект)
	
	Если Ложь Тогда СсылкаНаОбъект = Документы.НаправлениеСтационар.ПустаяСсылка() КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("НаправлениеСтационар");
	ОбластьДокумент = Макет.ПолучитьОбласть("НаправлениеСтационар");
	
	// Данные организации
	СтруктураРеквизитовОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект); 
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.НазваниеОрганизации) Тогда
		ОбластьДокумент.Параметры.НазваниеОрганизации = СтруктураРеквизитовОрганизации.НазваниеОрганизации;
	КонецЕсли;

	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Адрес) Тогда
		ОбластьДокумент.Параметры.АдресОрганизации = СтруктураРеквизитовОрганизации.Адрес;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ИНН) И
		 ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.КПП)
	Тогда
		ОбластьДокумент.Параметры.ИННКПП = "ИНН: " + СтруктураРеквизитовОрганизации.ИНН + ", КПП: " + СтруктураРеквизитовОрганизации.КПП; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Телефон) Тогда
		ОбластьДокумент.Параметры.Телефон = СтруктураРеквизитовОрганизации.Телефон;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ОГРН) Тогда
		ОбщегоНазначения.ЗаполнитьПараметрПосимвольно(ОбластьДокумент,"ОГРН", СтруктураРеквизитовОрганизации.ОГРН);
	КонецЕсли;
	
	ОбластьДокумент.Параметры.КудаНаправлен = ПредставлениеУчрежденияНаправленияДляПечати(СсылкаНаОбъект.УчреждениеНаправления);
	ОбластьДокумент.Параметры.ОбоснованиеНаправления = Строка(СсылкаНаОбъект.ОбоснованиеНаправления);
	
	ЗапросКлиент = Новый Запрос;
	ЗапросКлиент.УстановитьПараметр("Клиент",СсылкаНаОбъект.Клиент);
	ЗапросКлиент.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Клиенты.Фамилия,
	|	Клиенты.Имя,
	|	Клиенты.Отчество,
	|	Клиенты.Пол,
	|	Клиенты.ДатаРождения,
	|	Клиенты.СНИЛС КАК СНИЛС,
	|	Клиенты.умцМестоРаботы КАК МестоРаботы,
	|	Клиенты.умцМестоРаботыДополнительное КАК МестоРаботы2,
	|	Клиенты.умцМестоРаботы.НаименованиеПолное КАК умцМестоРаботы1НаименованиеПолное
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Ссылка = &Клиент"
	;
	ВыборкаКлиент = ЗапросКлиент.Выполнить().Выбрать();
	ВыборкаКлиент.Следующий();  
	
	ОбластьДокумент.Параметры.ФИО_Пациент = СокрЛП(ВыборкаКлиент.Фамилия) + " " + СокрЛП(ВыборкаКлиент.Имя) + " " + СокрЛП(ВыборкаКлиент.Отчество);
	
	Если ЗначениеЗаполнено(ВыборкаКлиент.ДатаРождения) Тогда 
		ОбластьДокумент.Параметры.ДатаРождения = Формат(ВыборкаКлиент.ДатаРождения,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаКлиент.МестоРаботы) Тогда 
		ОбластьДокумент.Параметры.МестоРаботы = ВыборкаКлиент.МестоРаботы;
	КонецЕсли;
	
	Полис = СсылкаНаОбъект.Клиент.умцОсновнойСтраховойПолис;
		
	Если ЗначениеЗаполнено(Полис) Тогда
		ОбщегоНазначения.ЗаполнитьПараметрПосимвольно(ОбластьДокумент,"НСП", СокрЛП(Полис.Номер)+" "+СокрЛП(Полис.Серия));
	КонецЕсли;
	
	ОбластьДокумент.Параметры.КодДиагнозаПоМКБ			= СсылкаНаОбъект.Диагноз.КодДиагноза;
	ОбластьДокумент.Параметры.ОбоснованиеНаправления	= СсылкаНаОбъект.ОбоснованиеНаправления;
	ОбластьДокумент.Параметры.Должность					= СсылкаНаОбъект.Должность;
	ОбластьДокумент.Параметры.ВрачНаправивший			= СокрЛП(СсылкаНаОбъект.ВрачНаправивший.Фамилия) + " " + Лев(СокрЛП(СсылкаНаОбъект.ВрачНаправивший.Имя),1) + ". " + Лев(СокрЛП(СсылкаНаОбъект.ВрачНаправивший.Отчество),1) + ".";
	ОбластьДокумент.Параметры.ЗавОтделением				= СокрЛП(СсылкаНаОбъект.ЗаведующийОтделением.Фамилия) + " " + Лев(СокрЛП(СсылкаНаОбъект.ЗаведующийОтделением.Имя),1) + ". " + Лев(СокрЛП(СсылкаНаОбъект.ЗаведующийОтделением.Отчество),1) + ".";
	ОбластьДокумент.Параметры.ДатаДокумента				= Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
	
	ТабДокумент.Вывести(ОбластьДокумент);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
		
КонецФункции

Функция ПредставлениеУчрежденияНаправленияДляПечати(УчреждениеНаправления)
	
	КудаНаправлен = Строка(УчреждениеНаправления);
	
	Если ТипЗнч(УчреждениеНаправления) = Тип("СправочникСсылка.Контрагенты")
		И ЗначениеЗаполнено(УчреждениеНаправления.НаименованиеПолное) 
	Тогда
		КудаНаправлен = УчреждениеНаправления.НаименованиеПолное;
		
	ИначеЕсли ТипЗнч(УчреждениеНаправления) = Тип("СправочникСсылка.Филиалы") Тогда
		
		РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(УчреждениеНаправления);
		Если ЗначениеЗаполнено(РеквизитыОрганизации.НазваниеОрганизации) Тогда
			КудаНаправлен = РеквизитыОрганизации.НазваниеОрганизации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КудаНаправлен;
	
КонецФункции

#КонецОбласти
